12/data/attachments/c61c34528e9a5790.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Michael_discussion_Actions_42890_3</nif:username>
            <nif:friendToBeRequested>soap_actions_96faaca7-9f55-4475-aa2f-a65f87d7b536</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>